bench/log/linux/2026-08-03-acik-walker-hits-med3/wrk-base-t2.txt
Running 30s test @ http://127.0.0.1:3624/api/v1/
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   341.57ms   89.95ms   1.18s    79.84%
    Req/Sec   145.66     54.10   340.00     63.55%
  8720 requests in 33.65s, 303.13MB read
  Socket errors: connect 0, read 0, write 0, timeout 100
Requests/sec:    259.11
Transfer/sec:      9.01MB